app/controllers/application_controller.rb

  def index
    @projects = UnfinishedProject.all
---
SELECT "unfinished_projects".* FROM "unfinished_projects"

  def project
    @unfinished_project = UnfinishedProject.find_by_short_name(params[:short_name])
---
SELECT "unfinished_projects".* FROM "unfinished_projects" WHERE "unfinished_projects"."short_name" = 'project_2' LIMIT 1