app/controllers/unfinished_projects_controller.rb

  def index
    @unfinished_projects = UnfinishedProject.all
---
SELECT "unfinished_projects".* FROM "unfinished_projects"